---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitPathModeParam
source: html/3d109321-6a47-f148-e0c8-812fb0c19de2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitPathModeParam Property

"Path Mode"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecCircuitPathModeParam { get; }
```